[{
  "locationid": "32",
  "gamerealmid": "1",
  "locationname": "East Castle Grounds",
  "description": "The East Castle Grounds consist of a meticulously maintained garden space nestled along the eastern face of the castle keep. Enclosed by low stone walls and flanked by the imposing bulk of the keep to the west, the grounds offer a quiet respite from the stone and shadow within.\n\nThe gardens are arranged in geometric patterns, with raised stone-bordered beds filled with a mix of culinary herbs, medicinal plants, and seasonal blooms. Rosemary, thyme, and sage mingle with lavender and marigold, while small trees—fig, quince, and hazel—cast dappled shadows over stone benches set at intervals along the gravel paths. A central flagstone circle, often used for quiet conversation or solitary reflection, holds a low sundial of bronze, greened with age.\n\nOn the western edge, the castle keep rises with quiet authority. Two solid wooden doors, framed in dressed stone, lead back inside. The northernmost door, plain and utilitarian, provides access to the Kitchen Entrance, regularly used by staff and servants bearing garden baskets and barrels. The southernmost door, more finely constructed with an iron pull ring and weathered threshold, leads to the Side Entrance, often used by household members wishing to move discreetly between the castle and its grounds.\n\nSet into the surrounding garden are stone urns carved with motifs of wheat and wildflowers, each filled with small, flowering shrubs. A weathered stone statue of a stoic, cloaked figure holding a sheaf of grain stands near the wall, its features softened by wind and time, believed to represent a long-forgotten guardian of the land.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["35", "36"],
  "loc_x": "-1",
  "loc_y": "-1",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "33",
  "gamerealmid": "1",
  "locationname": "North Castle Grounds",
  "description": "The North Castle Grounds form a broad, open expanse at the foot of the keep\u0027s northern wall, serving as the principal approach for arriving visitors, messengers, and patrols. Flattened and cleared of obstacles, the ground is covered in packed earth and gravel, hardened by the tread of carts, horses, and boots over generations. The area is functional, yet holds an understated dignity befitting its role as the first impression of Lord Deyric\u0027s domain.\n\nTo the north, a worn but well-kept path stretches outward, lined with weathered posts bearing iron torch brackets. This road leads to the outer castle wall and the main gate, visible in the distance between two watch towers, their silhouettes rising like silent sentinels. From the gate, visitors wind their way up through the outer grounds to this wide court, which gently slopes upward toward the keep itself.\n\nThe southern boundary of the grounds is defined by the northern face of the castle keep, a sheer wall of stone blocks—cold, grey, and resolute. Set into the wall is a single arched oak door, banded with iron and flanked by stone pilasters. This is the Main Entrance, the primary threshold into the keep proper. Above the doorway, carved directly into a lintel of blackened stone, is a relief of Lord Deyric\u0027s sigil—the iron tower, silver crescent moon, and coiled serpent—weathered but unmistakable.\n\nA few elements of formality and defense mark the space: stone bollards delineate the path to the entrance; iron braziers, currently cold, stand ready to be lit for light or ceremony. To the side, a covered mounting block allows visitors to dismount from horseback with dignity, while a simple stone trough near the wall holds water for animals, fed from a concealed cistern within the keep.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["34"],
  "loc_x": "-1",
  "loc_y": "-1",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "31",
  "gamerealmid": "1",
  "locationname": "South Castle Grounds",
  "description": "The South Castle Grounds lie in a rugged expanse of land pressed between the southern flank of the castle keep and the sheer drop of the outer slope. The terrain here is steep and rocky, scattered with coarse grasses, gnarled shrubs, and patches of moss clinging stubbornly to stone. The ground underfoot is uneven, composed of weathered rock outcroppings and loose gravel that crunches under each step.\n\nTo the north, the stone wall of the castle keep looms high above, solid and unadorned, its base partly embedded into the slope itself. Occasional drainage spouts, shaped from clay and stone, jut from the lower courses, allowing runoff from the higher levels of the keep to trickle down during heavy rains.\n\nA narrow, winding path runs southward, roughly carved from the natural rock. The path descends steeply in tight switchbacks toward the outer curtain wall of the castle. Sections of it are reinforced with timber planks and lined with simple wooden posts for guidance. The descent is not meant for ceremony but for function—used by patrols, groundskeepers, or messengers needing to reach the lower grounds quickly.\n\nFlanking the path in places are weather-worn boundary stones, some carved with faded symbols indicating the reach of the lord\u0027s domain. Nestled among the rocks, a half-collapsed stone outpost, no larger than a shed, hints at older watch points once used to keep eyes on the southern approach.\n\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["27"],
  "loc_x": "-1",
  "loc_y": "-1",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "30",
  "gamerealmid": "1",
  "locationname": "North Secret Passage",
  "description": "Tucked within the thick northern walls of Lord Deyric\u0027s keep, the North Secret Passage runs east to west, a narrow, quiet artery hidden from the daily bustle of the stronghold. Its rough-hewn stone walls and low-vaulted ceiling betray its age, bearing the marks of countless footsteps from secretive comings and goings.\nThe passage is dimly lit by occasional wall niches, each once holding oil lamps, though most now lie cold and dry, the soot trails above them telling of long-forgotten use. The air is cool and still, with a faint trace of old parchment and beeswax lingering—scents that hint at its proximity to the library and the lord\u0027s private chambers.\nAt the east end of the passage stands a small wooden door leading into the North-West Secret Passage.\nAlong the south wall, near the east end, another concealed entry leads into the Library. The door appears as a recessed panel, its edges marked by faint toolwork meant to aid those in the know.\nAt the west end of the south wall, a sturdier, iron-banded door, this one more visible but no less secure, grants secret access to the Lord\u0027s Bedchamber.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["29", "4", "2"],
  "loc_x": "1001",
  "loc_y": "1001",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "39",
  "gamerealmid": "1",
  "locationname": "Vault",
  "description": "The Vault is a compact, heavily secured chamber, concealed deep within the keep\u0027s inner structure. A solid oak door, reinforced with iron bands and rivets, is set into the southern section of the east wall. The locking mechanism is intricate and well-maintained, designed to resist tampering and ensure the contents remain safe from all but the most trusted members of Lord Deyric\u0027s household.\n\nThe walls are of rough-hewn stone, cold to the touch and left bare to discourage tampering or concealment. The flicker of a single oil lamp mounted near the ceiling casts long, shifting shadows across the chamber.\n\nInside, the room is orderly and deliberate. Stacks of coarse linen sacks, filled with coin of varying weight and origin, rest atop low stone platforms and sturdy wooden crates. Many are marked with charcoal symbols denoting their contents. Near one wall, a broad-lipped ceramic bowl contains a pile of unworked gems and cut stones wrapped in oiled cloth—rubies, sapphires, amber, and jet.\n\nAlong the western wall, iron ingots and bars of silver and copper are stacked neatly on a timber shelf, their surfaces dulled with age and use. Resting atop a small side table is a locked iron coffer, presumed to contain items of particular value or sensitive use, such as ledgers, signet rings, or official seals.\n\nA weathered ledger book, its binding reinforced with strips of hide, sits open on a wooden stand in the corner. Written in a disciplined hand, its entries list weights, tallies, and receiving dates, all maintained with exacting precision.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["29"],
  "loc_x": "1001",
  "loc_y": "1014",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "27",
  "gamerealmid": "1",
  "locationname": "South Secret Passage",
  "description": "The South Secret Passage is a narrow, stone-lined corridor hidden deep within the structure of the castle, running in a long, straight line from east to west. Dimly lit by small, inset sconces holding oil lamps, the air here carries a faint scent of damp stone and herbs, lingering from centuries of quiet use. The walls are bare but worn smooth by time, their stones dark and cool beneath the touch.\nAt the east end, a concealed wooden door set seamlessly into the wall leads to the South-East Secret Passage, its hinges silent and well-maintained. Just a few steps west along the southern wall, another low, iron-bound door opens into the South Castle Grounds, providing an escape route to the exterior under cover of shadow.\nThe floor is made of tightly fitted flagstones, scattered with the occasional cobweb, though signs of use—boot scuffs and the faint drag of fabric—hint at its continued purpose. Lantern hooks line the ceiling sparsely, though only a few still bear working lamps.\nAt the western end of the corridor, two doors break the northern wall. The westernmost door leads into the South-West Secret Passage, a narrow portal used for moving unseen across the western wing. Just a few paces to the east, another hidden panel reveals a discreet entry to the Lady\u0027s Bedchamber, carefully masked with a stone façade when closed.\nDirectly opposite that, embedded in the southern wall, a reinforced wooden door with strange alchemical symbols lightly etched into its surface leads to the Alchemy Chamber. The door smells faintly of burnt sage and iron, and the brass handle is often warm to the touch, as though recently used.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["31", "10", "28", "38"],
  "loc_x": "1002",
  "loc_y": "1001",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "29",
  "gamerealmid": "1",
  "locationname": "North West Secret Passage",
  "description": "The North-West Secret Passage is a narrow, stone corridor running north to south, deep within the hidden framework of the castle\u0027s western bastion. Its construction is stark and functional—crafted for secrecy and resilience—yet centuries of silent passage have left their mark on the worn stone floor and the smoothed edges of the walls.\n\nThe ceiling is low and slightly arched, with aged beams supporting the ancient stone overhead. Flickering wall-mounted sconces, spaced at long intervals, offer dim pools of flickering light when lit, casting long, wavering shadows. Even unlit, the air carries the cool stillness of underground places, tinged faintly with iron and dust.\n\nAt the north end, a narrow, well-fitted stone door leads to the North Secret Passage. It is unadorned save for a small, crescent-shaped notch above the handle—a subtle reference to Lord Deyric\u0027s sigil. The handle itself is iron, cold to the touch and smoothed by frequent use.\n\nThe southern end connects to the South-West Secret Passage through a similar, seamless stone door, its hinges buried deep within the wall and designed to close soundlessly.\n\nThe passage bears signs of quiet use: there are scuff marks midway along the western wall, faint soot trails near the ceiling from long-burned lanterns, and a forgotten brass key hanging from a small iron hook recessed into a shadowed alcove.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["28", "30", "39"],
  "loc_x": "1002",
  "loc_y": "1016",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "17",
  "gamerealmid": "1",
  "locationname": "Lady\u0027s Bathchamber",
  "description": "The Lady\u0027s Bathchamber is a small yet serene retreat, designed to provide comfort and refinement for the castle\u0027s noblewoman. Enclosed by smooth stone walls, the chamber retains warmth from a brazier in the corner, its embers casting a soft, golden glow. The floor is paved with polished limestone tiles, their pale hues adding to the chamber\u0027s tranquil atmosphere.\n\nAt the east end, a finely crafted wooden door, adorned with delicate iron filigree, connects the bathchamber to the Lady\u0027s Bedchamber. A heavy velvet curtain, embroidered with floral motifs in silver and crimson thread, can be drawn across the doorway to ensure privacy.\n\nThe bathing area is the chamber\u0027s central feature—a deep, oval-shaped stone tub, carved from smooth alabaster and set upon a slightly raised platform. The tub\u0027s edges are wide enough to hold bronze bowls of scented oils, rose petals, and finely ground soapstone powders. A copper ewer, warmed by the brazier, stands ready to provide hot water, while a wooden bucket lined with beeswax sits nearby for cooler rinses. A silver-handled ladle, engraved with curling ivy, rests beside the basin.\n\nAgainst the north wall, a small carved bench, cushioned with soft wool and silk fabric, provides a comfortable seat. Above it, a tall bronze mirror, framed in delicate filigree of twisting vines and crescent moons, allows the lady to attend to her appearance with ease. A dark oak cabinet, its doors adorned with tiny inlaid pearls, holds linen towels, glass vials of fragrant oils, and herbal sachets to perfume both skin and clothing.\n\nIn the southwest corner, a private garderobe is discreetly tucked into an alcove, separated by a folding wooden screen, painted with scenes of moonlit gardens. The smooth stone seat, built over a chute leading to a cesspit below, is accompanied by a shelf stocked with wool cloths, dried lavender bundles, and a small clay jar of fine sand for cleansing. A silver incense burner, shaped like a coiled serpent, releases a faint aroma of myrrh and jasmine, keeping the air fresh.\n\nDespite its modest size, the Lady\u0027s Bathchamber is a haven of warmth and tranquility, offering a quiet respite where noble refinement and personal comfort blend seamlessly.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["10"],
  "loc_x": "1002",
  "loc_y": "1004",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "28",
  "gamerealmid": "1",
  "locationname": "South West Secret Passage",
  "description": "The South-West Secret Passage is a quiet, curving corridor of ancient stone, tucked within the inner walls of the keep and used for discrete movement throughout the castle. Running primarily north to south, it bends in a crescent westward curve near the southern end, giving it the feel of an old path worn into the bones of the fortress.\nThe walls are made of rough-hewn granite, their surfaces cool and uneven to the touch, with traces of old tool marks still visible beneath a thin patina of dust and age. Narrow arrow-slit windows, set high in the west-facing curve, allow in slivers of light during the day, illuminating the passage just enough to navigate without torchlight. At night, iron wall sconces spaced at regular intervals can hold oil lamps or candles, though only a few show recent use.\nAt the north end of the passage, a hidden door with an iron latch grants access to the North-West Secret Passage, offering a discreet route deeper into the keep. Not far from this, on the east wall, lies a remarkable piece of deception—the secret door to the West Guest Bedroom.\nThis door is a masterwork of concealment. Its surface is faced entirely in matching limestone, and the seams have been expertly fitted so they align with the surrounding stone blocks. Without knowledge of its presence, one might walk past it a dozen times and never notice. \nAs the passage bends westward near the south end, the air grows cooler, and a subtle draft can be felt. At the southern tip, another thick oak door—this one reinforced with iron bands and a cleverly concealed locking mechanism—leads into the South Secret Passage, continuing the hidden network beneath the castle.\nThe floor underfoot is uneven in places, worn smooth where generations of boots and quiet footsteps have passed. Small alcoves are set into the walls at irregular intervals, some still containing cobwebbed shelves, dusty candles, or even old iron tools forgotten over the years. A tarnished brass shield, mounted high on the outer curve of the bend, bears the faint etching of a tower and crescent moon—Lord Deyric\u0027s sigil, now nearly faded from sight.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["46597"],
  "loc_x": "1002",
  "loc_y": "1009",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "37",
  "gamerealmid": "1",
  "locationname": "Dungeon",
  "description": "The Dungeon lies deep beneath the castle keep, carved into the bedrock itself—a low, square subterranean chamber where stone walls drip with the chill damp of the earth. The air is heavy, cool, and close, carrying the scent of old iron, stale straw, and time-forgotten secrets. Dimly lit by a pair of iron sconces, their flickering torches barely chase away the shadows clinging to the corners of the room.\n\nOn the south wall, a heavy wooden door bound in rusting iron leads upward to the Dungeon Stairway. Reinforced with thick rivets and set into a deeply recessed archway, the door groans on its hinges when opened, and a sliding iron bar on the interior allows it to be bolted fast from within.\n\nThe walls are lined with three shallow stone alcoves, each housing a crude iron-barred cell with wrought iron doors. Within, there is little more than a scattering of old straw, a wooden bucket, and the occasional length of rusted chain bolted to the walls or floor. The iron rings embedded in the stone speak to grim purpose, their edges worn smooth from long years of use.\n\nIn the northeast corner, a stone bench bears the weight of a simple iron basin, a clay jug of water, and a battered lantern, blackened by soot and age. Nearby, a wall-mounted rack holds a handful of iron keys—each tagged with a worn scrap of parchment denoting their intended lock.\n\nA narrow slotted window, little more than a thin vertical crack high on the north wall, allows the faintest trace of natural light and air to reach the chamber. At certain times of day, a shaft of pale sunlight cuts through the gloom, illuminating the motes of dust and lending the room a haunting, almost reverent stillness.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["40"],
  "loc_x": "1003",
  "loc_y": "1000",
  "loc_z": "-1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "9",
  "gamerealmid": "1",
  "locationname": "Lady\u0027s Gallery",
  "description": "The Lady\u0027s Gallery is a captivating square chamber adorned with intricate craftsmanship. The room\u0027s entrance is a sturdy wooden door, adorned with the iron-wrought serpent frame, found on the northern wall, leading to the Lady\u0027s Hallway. Opposite, a smaller door of equal craftsmanship awaits on the southern wall, providing access to the Lady\u0027s Bedchamber. The room\u0027s eastern windows offer a breathtaking panorama of the surrounding landscape.\n\nThe walls of the Lady\u0027s Gallery are adorned with a collection of eclectic artworks, subtly hinting at themes of sensuality and fertility. Each piece, gathered from far-off lands, adds a unique story to the room\u0027s allure. The visual narrative unfolds as one moves around the room, the artworks skillfully arranged to evoke a sense of intrigue and fascination.\n\nA collection of ornate mirrors, carved from exotic woods and inlaid with precious stones, are strategically placed throughout the room, reflecting the artworks and their intricate details. The mirrors also serve to amplify the room\u0027s sense of space and grandeur.\n\nThe floor is covered with a plush, intricately designed rug, its patterns echoing the Sigil of Lord Deyric. The rug\u0027s vibrant colors and detailed design serve as a striking contrast to the room\u0027s stone walls.\n\nSeveral pieces of furniture, including a low table and a velvet-covered divan, are arranged in the center of the room, inviting quiet contemplation. The table is adorned with a selection of curated objects, each with a story to tell: a sculpture of a fertility goddess from a distant land, an ornate carved ivory phallus, a sculpture crafted from jade, depicting two intertwined figures in an intimate embrace, and a set of delicate mother-of-pearl fans, their intricate patterns hinting at the mysteries of creation.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["45938"],
  "loc_x": "1003",
  "loc_y": "1006",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "38",
  "gamerealmid": "1",
  "locationname": "Alchemy Chamber",
  "description": "The Alchemy Chamber, a place where the mundane and the magical intertwine, is a testament to Lady Seraph\u0027s mastery over the arcane arts and her unending quest for knowledge.\nA room of subtle dimensions, its square layout is defined by the rough-hewn stones that form the walls, each bearing the marks of ancient chisels and the passage of time. The room\u0027s solitary entrance, a heavy oak door adorned with intricate ironwork, is situated on the northern wall, leading to the South Secret Passage.\nUpon entering, one\u0027s gaze is immediately drawn to the vast, ornate table that dominates the center of the chamber. The table, meticulously carved from a single piece of ancient oak, is strewn with an assortment of glass vials, ceramic mortars, and brass ladles - all worn and tarnished from years of use. Various ingredients, ranging from the common, such as herbs and berries, to the exotic, are neatly arranged in small, leather-bound pouches, waiting to be combined in the next elixir.\nA large, brass cauldron, with an intricate pattern of intertwined serpents and dragons, sits atop the table, its contents hidden beneath a swirling, multicolored concoction. Along the eastern and western walls, long, wooden shelves are crammed with an array of books, scrolls, and parchments, filled with ancient recipes, cryptic formulas, and arcane knowledge.\nTwo benches, crafted from weathered wood, flank the working table, each adorned with an assortment of labor-worn mortars and pestles. Upon the walls, various trinkets and artifacts collected during Lady Seraph\u0027s travels hang, their origins lost to time.\nThe chamber\u0027s ceiling, though low, is punctuated by several large vents, designed to disperse the potent fumes that often fill the room during Lady Seraph\u0027s alchemical experiments. These vents, crafted from the same rugged stones as the walls, blend seamlessly into their surroundings when unoccupied, save for the occasional wisp of smoke that escapes their confines.\nOn the southern wall, an elaborate iron and glass cabinet houses an array of exotic ingredients - powders, herbs, and crystals from far-off lands.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["27"],
  "loc_x": "1003",
  "loc_y": "1000",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "18",
  "gamerealmid": "1",
  "locationname": "Lord\u0027s Bathchamber",
  "description": "The Lord\u0027s Bathchamber is a small yet serene retreat. Enclosed by smooth stone walls, the chamber retains warmth from a brazier in the corner, its embers casting a soft, golden glow. The floor is paved with polished limestone tiles, their pale hues adding to the chamber\u0027s tranquil atmosphere.\nAt the south end, a finely crafted wooden door, adorned with delicate iron filigree, connects the bathchamber to the Lord\u0027s Bedchamber. A heavy velvet curtain, embroidered with floral motifs in silver and crimson thread, can be drawn across the doorway to ensure privacy.\n\nThe bathing area is the chamber\u0027s central feature—a deep, oval-shaped stone tub, carved from smooth alabaster and set upon a slightly raised platform. The tub\u0027s edges are wide enough to hold bronze bowls of scented oils, rose petals, and finely ground soapstone powders. A copper ewer, warmed by the brazier, stands ready to provide hot water, while a wooden bucket lined with beeswax sits nearby for cooler rinses. A silver-handled ladle, engraved with curling ivy, rests beside the basin.\n\nAgainst the east wall, a small carved bench, cushioned with soft wool and silk fabric, provides a comfortable seat. Above it, a tall bronze mirror, framed in delicate filigree of twisting vines and crescent moons, allows the lady to attend to her appearance with ease. A dark oak cabinet, its doors adorned with tiny inlaid pearls, holds linen towels, glass vials of fragrant oils, and herbal sachets to perfume both skin and clothing.\n\nIn the northwest corner, a private garderobe is discreetly tucked into an alcove, separated by a folding wooden screen. The smooth stone seat, built over a chute leading to a cesspit below, is accompanied by a shelf stocked with wool cloths, dried lavender bundles, and a small clay jar of fine sand for cleansing. A silver incense burner, shaped like a coiled serpent, releases a faint aroma of myrrh and jasmine, keeping the air fresh.\n\nDespite its modest size, the Lord\u0027s Bathchamber is a haven of warmth and tranquility, offering a quiet respite where noble refinement and personal comfort blend seamlessly.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["4"],
  "loc_x": "1003",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "5",
  "gamerealmid": "1",
  "locationname": "Drawing Room",
  "description": "The Drawing Room is a space of quiet refinement, designed for private discussions, contemplation, and moments of leisure away from the rigid formality of the great hall. The walls are clad in dark wooden paneling, their surfaces polished smooth and adorned with subtle carvings of twisting ivy and heraldic patterns. A large doorway on the east wall opens into the West Hallway, framed by a finely wrought arch of carved stone, its edges softened by age.\n\nAt the heart of the room, a long wooden table rests atop a deep crimson rug, its woven patterns mirroring the sigil of Lord Deyric—a black iron tower against a crimson field, coiled by an iron serpent with a silver crescent moon above. Surrounding the table are high-backed chairs, their dark leather seats embossed with the same heraldic symbol, offering a comfortable place for strategy discussions, quiet reading, or the sharing of wine and conversation.\n\nA stone fireplace dominates the north wall, its carved mantle supporting a pair of iron candleholders and a small brass clock, its steady ticking the only sound when the room falls into thoughtful silence. Above the hearth hangs a portrait of Lord Deyric\u0027s Grandfather, his watchful gaze adding to the room\u0027s solemn atmosphere. On cold nights, the fire casts long shadows against the walls, lending the chamber a flickering warmth.\n\nAgainst the west wall, a low wooden sideboard holds an assortment of goblets, a silver decanter of wine, and a tray of polished glass bottles, each containing rare liquors and herbal infusions. Beside it, a small writing desk sits near a narrow window, its inkpot, quills, and half-written parchments hinting at letters left unfinished or plans quietly forming.\n\nThe air in the Drawing Room is tinged with the scent of aged parchment, wood polish, and the faintest trace of smoke from many evenings spent in thought or debate. It is a place of subtle power, where whispered words and measured decisions shape the fate of Lord Deyric\u0027s keep as surely as the swords of his warriors.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["3"],
  "loc_x": "1003",
  "loc_y": "1012",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "10",
  "gamerealmid": "1",
  "locationname": "Lady\u0027s Bedchamber",
  "description": "The Lady\u0027s Bedchamber, a space crafted for intimacy and opulence, is a square room adorned with rich tapestries and intricate carvings. The northern door, adorned with intricate craftsmanship, leads to the Lady\u0027s Gallery, while the western door grants access to the Lady\u0027s Bathchamber. The west and south walls each feature two tall, stained-glass windows, their vibrant hues painting the room with soft, shimmering light.\n\nFurniture within the chamber is crafted from the finest wood, its natural grain polished to a mirror-like sheen. A large, four-poster bed dominates the southern wall, its canopy draped in sumptuous, crimson fabric. It is upholstered in luxurious, deep-purple velvet, the sumptuous fabric adorned with golden thread that weaves delicate patterns reminiscent of a serpent\u0027s coil. The bed\u0027s headboard is embellished with a striking piece of art, a sensual carving of a pair of intertwined bodies, their passion palpable. Above the bed, a massive, gilded mirror reflects the room\u0027s sensual spectacle.\n\nOn the west side of the bed, a cabinet of dark, polished wood stands proudly. Inside, one finds a myriad of curiosities gathered from far-off lands. Among these treasures are exquisite carved ivory figurines, depicting intimate moments between lovers, their forms exquisitely detailed and provocative; a delicate jade fan, intricately designed with intertwining vines and blossoming flowers; and a set of obsidian daggers, their smooth, dark surfaces inviting and mysterious; small bottles and vials containing mysterious potions. Each object, carefully chosen, serves to heighten the senses and stimulate the imagination.\n\nThe west wall, adorned with a rich, crimson tapestry, serves as a backdrop for the chamber\u0027s most intriguing pieces. A sensual painting of a reclining nude woman, her form smooth and voluptuous. Her eyes, painted with a mesmerizing intensity, seem to follow the viewer wherever they move within the chamber.\n\nThe East wall holds the hearth, the stonework depicting entwined serpents, warmth radiates to the rest of the room. A low, plush couch is situated before the fireplace, its cushions adorned with embroidered serpents. A small, round table sits beside the couch, its top inlaid with mother-of-pearl and adorned with a delicate, silver candelabra. Further along the eastern wall towards the bed is a wardrobe, crafted from rich, dark wood, with intricate carvings of entwined serpents and leaves. The wardrobe offers ample storage for the Lady\u0027s clothing and personal belongings.\n\nCarefully placed upon a marble pedestal, an elaborate silver yoni, a symbol of femininity and fertility, rests next to a collection of carved wooden phallus contained within an ebony box inlaid with purple velvet.\n\nIn the southwestern corner of the room, a wall-mounted sculpture catches the eye. It is an elegant, curving form, crafted from a rare, swirling black marble. The piece subtly suggests the female form, its curves and contours invoking a sense of sultry, feminine power. \n\nBelow this sculpture, a small, silk-covered chest rests open, revealing an array of exquisite feathers, pearls, and beads, all intended for adornment and seduction.\n\nThe Northern wall holds a bookshelf, its surface laden with a selection of books, their pages filled with poetry and tales of seduction and a collection of candles, their wicks trimmed and ready, stands in a silver candelabra, their flickering flames casting dancing shadows upon the chamber\u0027s walls.\n\nA vanity table, adorned with a delicate, hand-carved marble top, sits along the northern wall. A large, winged-back chair upholstered in soft, white silk invites one to sit and prepare for the day or retire for the night. A small, mirror-topped cabinet sits opposite the chair, filled with the necessities of the ladies\u0027 dressing, including combs, brushes, and small perfume bottles.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["9", "10", "17", "27"],
  "loc_x": "1003",
  "loc_y": "1004",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "8",
  "gamerealmid": "1",
  "locationname": "Lady\u0027s Hallway",
  "description": "The Lady\u0027s Hallway, a narrow passageway that stretches from east to west. The worn, dark oak floorboards echo with the passage of time, their surface etched with intricate patterns of use. The doorway leading east to the West Hallway is adorned with an elaborate, iron-wrought frame, shaped like intertwined serpents. \n\nOn the south wall, a door leads to the Lady\u0027s Gallery. This door, like the one to the West Hallway, is also adorned with the iron-wrought serpent frame. The door to the gallery is flanked by two statues, one on each side, both depicting nymphs - their bodies sculpted with sensual curves and their expressions inviting.\n\nThe window on the west wall offers a breathtaking view of the mountainous landscape.\n\nA small, low table of dark, polished wood is positioned before the window, on its surface is a delicate porcelain vase, filled with fragrant wildflowers. A pair of ornate, carved chairs stand sentinel on either side, their seats cushioned with velvet and adorned with the iron serpent sigil.\n\nA long, low bench, carved from a single piece of mahogany, sits against the north wall. Its surface is upholstered in velvet, the color of freshly spilled blood. \n\nThe corridor is illuminated by torches installed in sconces along the walls, casting flickering shadows that dance upon the walls and floor. The torches, made of brass and iron, are adorned with intricate silver filigree.\n\nThe walls are adorned with tapestries of a more intimate nature. Scenes of romantic encounters between gods and mortals are woven in rich, vibrant colors.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["45725"],
  "loc_x": "1003",
  "loc_y": "1007",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "4",
  "gamerealmid": "1",
  "locationname": "Lords Bedchamber",
  "description": "The Lord\u0027s Bedchamber is a stately yet functional retreat, its broad, near-square layout subtly altered by an enclosed bathchamber in the northwest corner. The door to the bathchamber, a sturdy wooden panel with an iron handle, is set into the northwest wall, leading to a private space of stone and brass fixtures, where warm water is drawn for Lord Deyric\u0027s use.\n\nA door on the east wall opens into the Lord\u0027s Hallway, its frame carved with a subtle repeating pattern of ivy and tower motifs, mirroring the sigil of the house. The north and west walls are punctuated by large windows, their iron latticework forming intricate geometric patterns that allow sunlight to filter in by day and the cold mountain air to seep through at night. Heavy, deep-red curtains, embroidered with Lord Deyric\u0027s sigil, hang at either side, ready to be drawn against the chill or the prying eyes of courtiers.\n\nAgainst the north end of the east wall, a painting of the castle dominates the space—a masterful depiction of the keep and its surrounding mountains, painted in somber hues of gray and green, capturing both the strength and isolation of the stronghold. The frame is wrought of blackened iron, engraved with a thin border of intertwining serpents.\n\nAt the heart of the room, a great four-poster bed of dark oak stands, its headboard carved with the sigil of the house. Heavy fur-lined blankets and deep crimson silks cover the mattress, lending warmth to the otherwise cool stone chamber. A sturdy writing desk sits against the west wall, cluttered with maps, wax-sealed letters, and an iron candleholder bearing the last remnants of melted tallow. A small, locked chest rests beneath it, no doubt containing private correspondence or valuables.\n\nBeside the bed, a simple yet elegant nightstand holds a silver ewer of water, a half-full goblet, and a small dagger—perhaps placed there out of habit or necessity. A tall wardrobe of polished wood stands in the southern corner, its iron-bound doors containing Lord Deyric\u0027s formal attire, hunting leathers, and traveling cloaks.\n\nThe air carries the faint scent of aged wood, tallow smoke, and a lingering trace of leather and oil from the lord\u0027s armor. This is a room of both power and practicality—a retreat, but never a place of idle luxury.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["6", "18", "30"],
  "loc_x": "1004",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "6",
  "gamerealmid": "1",
  "locationname": "Lords Hallway",
  "description": "The Lord\u0027s Hallway is a short, straight passageway that stretches from north to south, providing a private and direct route to various areas of the castle. The north wall features a tall, narrow window that allows natural light to pour in, illuminating the hallway and casting a warm glow on the stone floor.\nAlong the east wall, a sturdy wooden door adorned with intricate carvings grants access to the Library, a treasure trove of ancient tomes and forbidden knowledge. The door is fitted with a heavy iron knocker in the shape of a lion\u0027s head, adding a touch of elegance and sophistication.\nOn the east wall, near the Library door, a painting hangs, drawing the eye with its vivid colors and haunting imagery. The painting depicts a dramatic seascape, with towering waves crashing against the shore and a ghostly shipwreck looming in the distance. In the foreground, a lone figure stands, gazing out to sea with an expression of longing and loss. The painting seems to whisper secrets of the past, inviting the viewer to ponder its mysteries.\nAt the southern end of the hallway, another door leads to the West Hallway, providing a convenient connection to other areas of the castle. Nearby, a small, ornate table stands against the wall, bearing a delicate silver candelabra and a single, flickering candle that casts a warm, golden light.\nOn the west wall, a richly decorated door leads to the Lord\u0027s Bed Chamber, a private sanctuary reserved for the castle\u0027s ruler. The door is adorned with intricate carvings and a heavy iron hinges, adding a touch of solidity and permanence. Above the door, a wooden crest bearing Lord Deyric\u0027s sigil hangs proudly, serving as a reminder of the castle\u0027s proud heritage.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["4", "2", "3"],
  "loc_x": "1005",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "3",
  "gamerealmid": "1",
  "locationname": "West Hallway",
  "description": "The West Hallway is a long, stone corridor running north to south, its high-arched ceiling supported by thick wooden beams darkened with age. The flagstone floor is worn smooth by generations of footsteps, and the dim glow of torches in iron sconces casts flickering shadows along the cold stone walls. The air is cool, carrying the faint scent of parchment, beeswax, and the distant aroma of burning wood from the hearths beyond.\n\nAt the north end, a heavy wooden door leads into the Lord\u0027s Hallway, its iron hinges and handle polished from years of use. Just to the northeast, another doorway opens into the Main Hallway, allowing easy passage between the wings of the keep. Further south, on the southeastern side, a wide archway connects to the South Hallway, while at the southernmost end, a reinforced door leads into the Southwest Hallway, its frame carved with a simple yet elegant border.\n\nAlong the west wall, three doors provide access to private chambers. The southernmost door, marked by a delicate engraving of ivy along its frame, leads into the Lady\u0027s Hallway, a more secluded passage reserved for Lady Deyric and her attendants. In the center, a plain yet sturdy door grants entry to the Western Guest Room, a space reserved for visiting dignitaries or favored retainers. The northernmost door, distinguished by an ornate brass handle shaped like a curling vine, opens into the Drawing Room, a space where nobles gather for conversation, music, and quiet reflection.\n\nFaint tapestries depicting hunting scenes and past battles hang between the doors, their colors faded but their craftsmanship undeniable. A single narrow table rests against the east wall, holding a brass candelabrum and a polished silver tray where messages and small parcels are left for couriers.\n\nDespite its simple purpose as a thoroughfare, the West Hallway carries a quiet dignity—its walls and doorways not just passages, but gateways into the lives and histories of those who reside within Lord Deyric\u0027s keep.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["1", "6", "5", "39", "12", "8", "21"],
  "loc_x": "1005",
  "loc_y": "1012",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "11",
  "gamerealmid": "1",
  "locationname": "South West Hallway",
  "description": "The Southwest Hallway is an L-shaped passage, partially open to the elements, running north to south before bending eastward. The northern end connects to the West Hallway via a heavy wooden door, its iron hinges etched with subtle ivy patterns. Along the east wall, a series of arched openings reveal a breathtaking view of the sunken courtyard gardens below. These archways, though elegant, offer no railing—only a sheer one-meter drop into the lush greenery below, where climbing vines and fragrant herbs thrive in the cool mountain air.\n\nAt the southern end, where the corridor turns eastward, a narrow stone staircase descends gracefully into the Courtyard, its edges smoothed by years of use. Here, the open-air nature of the hallway becomes more apparent—crimson banners bearing Lord Deyric\u0027s sigil flutter lightly from iron brackets mounted along the outer wall, their black iron tower, silver crescent moon, and coiled serpent a constant reminder of his dominion. The western wall, however, remains solid and unbroken, its cool stone surfaces offering contrast to the open archways opposite.\n\nAt the very eastern end of the hallway, a sturdy door leads into the West Bathchamber, framed by a modest carved lintel bearing the serpent-and-tower sigil of the lord\u0027s house. Near this entrance, a simple wooden bench rests against the wall, its seat softened by a folded fur-lined cushion, a spot where one might pause to enjoy the courtyard view or wait in contemplation.\n\nBetween the archways, iron sconces hold brass lanterns, their glass panes etched with swirling patterns, providing a soft golden glow in the evening hours. Against the solid western wall, a stone relief is set into the masonry, depicting an ancient battle scene—armored warriors clashing before a towering keep, their shields bearing the same black tower and serpent sigil that still flies above the castle today. Below this relief, a narrow wooden side table holds an unglazed clay bowl filled with fresh herbs from the courtyard gardens, the scent of lavender and rosemary mingling with the crisp mountain air.\n\nDespite its function as a simple corridor, the Southwest Hallway is a place where nature and fortress blend—a space of shifting light, mountain breezes, and quiet contemplation before stepping into the warmth of the chambers beyond.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["16", "14", "3"],
  "loc_x": "1005",
  "loc_y": "1005",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "14",
  "gamerealmid": "1",
  "locationname": "Court Yard",
  "description": "The Courtyard is a serene, open-air garden oasis, nestled 1 meter below the surrounding hallways. There are sounds of sweet songs of birds and the gentle rustle of leaves.\nTo the north, a elegant staircase rises between pillars, connecting the Courtyard to the South Hallway. The pillars, adorned with intricate carvings of Lord Deyric\u0027s sigil, support a delicate stone balustrade that adds a touch of refinement to the space.\nThe eastern wall of the Courtyard features a series of tall, narrow windows that offer a glimpse into the South East Hallway. The windows are adorned with stained glass depictions of the iron serpent and crescent moon from Lord Deyric\u0027s sigil, casting colorful patterns across the courtyard floor.\nAlong the southern wall, a stairway rises on the eastern side, leading up to a sturdy wooden door that grants access to the South East Hallway. The door is emblazoned with Lord Deyric\u0027s sigil, serving as a reminder of the castle\u0027s proud heritage.\nAt the western end of the southern wall, a second set of steps leads up to the open-air South West Hallway, offering breathtaking views of the surrounding mountains.\nThe courtyard itself is beautifully landscaped, with a variety of plants and flowers carefully selected to thrive in the mountainous climate. A small, tranquil fountain bubbles away in the center of the courtyard, its gentle melody adding to the sense of peace and serenity that pervades this special place.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["12", "15", "11"],
  "loc_x": "1006",
  "loc_y": "1005",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "2",
  "gamerealmid": "1",
  "locationname": "Library",
  "description": "The Library is a rectangular chamber of quiet reverence, its north-south length stretching half again as long as its west-east width. Dark wooden shelves line the walls, their surfaces smooth with age and laden with tomes bound in leather and cloth. The air carries the scent of parchment, ink, and aged wood, mingling with the faint aroma of beeswax from candles flickering in iron sconces.\n\nA tall window on the north wall lets in pale daylight, its lattice of iron bars forming a geometric pattern against the glass. Below it, on the eastern side, a large bookcase stands filled with meticulously arranged volumes, its highest shelves accessible by a wooden ladder. Some books bear the sigil of Lord Deyric—a black iron tower upon a crimson field, entwined with a coiled serpent and crowned by a silver crescent moon, embossed in silver on their spines.\n\nAt the center of the room, a sturdy reading table of dark oak is scattered with open tomes, parchment scrolls, and a bronze inkwell with a quill resting beside it. A small oil lamp, its glass chimney smudged with soot, provides additional illumination. Surrounding the table are several high-backed chairs, their wooden frames carved with Lord Deyric\u0027s sigil, marking this as a place of study for his scholars and advisors.\n\nTo the west, a doorway leads into the Lord\u0027s Hallway, its frame subtly adorned with carved ivy. To the east, another door opens into the Main Hallway, its threshold softened by a well-worn rug. Against the west wall, a writing desk holds neatly stacked scrolls, a half-melted candle in a brass holder, and a signet stamp bearing Deyric\u0027s sigil, used for marking official records.\n\nThe library is a sanctuary of thought and history, where the weight of knowledge presses down from every shelf, and the presence of Lord Deyric\u0027s legacy lingers in the very stones.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["1", "6", "30"],
  "loc_x": "1006",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "13",
  "gamerealmid": "1",
  "locationname": "Great Hall",
  "description": "The Great Hall stands as the majestic heart of the castle keep—a vast, rectangular chamber where stone, wood, and firelight combine to create an atmosphere of power and grandeur. The soaring ceiling, supported by massive timber beams, is adorned with intricately carved motifs of celestial patterns, coiling serpents, and the tower of Lord Deyric\u0027s sigil, their dark wood contrasting against the pale stone above. The polished flagstone floor gleams in the flickering light of iron-wrought chandeliers, their many beeswax candles casting shifting shadows upon the walls.\n\nThe walls of the Great Hall are a testament to history, adorned with richly woven tapestries depicting epic battles, legendary hunts, and moments of triumph. One tapestry, hung along the south wall, portrays Lord Deyric\u0027s ancestors standing victorious before the ruins of a fallen keep, the crimson and silver threads catching the light as if the battle still rages. Another, stretched across the east wall, illustrates a celestial map, its embroidered moons and stars forming a connection between the keep\u0027s earthly strength and the guiding heavens above.\n\nBetween these tapestries, ornamental weapons and armor are displayed—gilded longswords, engraved battle-axes, and polished helms mounted on dark oak plaques. A suit of blackened plate armor, its breastplate emblazoned with the iron tower and serpent of House Deyric, stands like a silent sentinel near the entrance, its gauntleted hands resting upon the pommel of a greatsword.\n\nAt the north end, a large, arched wooden door, banded with iron reinforcements, leads to the Main Hallway, serving as the primary threshold for guests and inhabitants alike. Above it, a hand-carved wooden crest bearing Lord Deyric\u0027s sigil hangs in a place of honor, its deep crimson backdrop and black iron tower illuminated by the torchlight.\n\nTo the east, a finely carved doorway leads to the Banquet Hall, framed by stone columns adorned with intricate serpent reliefs. Near this entrance, a long wooden sideboard stands, polished to a sheen, its surface laden with silver goblets, engraved flagons, and a magnificent gilded drinking horn—a prize from a long-forgotten war.\n\nOn the south wall, a smaller doorway opens into the South Hallway, providing a pathway toward the courtyard and private chambers. Here, a row of tall, arched windows lets in streams of natural light, offering a view of the courtyard gardens below. Beneath these windows, a plush, velvet-covered bench, embroidered with gold and crimson thread, provides a quiet retreat for those who wish to observe the hall from the shadows.\n\nThe easternmost wall is dominated by a grand stone fireplace, its mantle a masterwork of craftsmanship, bearing intricate carvings of intertwined serpents, watchful falcons, and crescent moons. The hearth blazes with a roaring fire, its light reflecting off the gleaming silver candelabras, delicate porcelain vases, and an array of ornate, lacquered wooden boxes that rest upon the mantle—each a relic of past rulers, containing scrolls, keepsakes, or hidden secrets.\n\nBeneath the flickering glow of the fire, sturdy wooden tables and high-backed chairs fill the center of the hall, arranged to accommodate both intimate councils and raucous feasts. The tables are adorned with fine linens, intricately etched silverware, and heavy pewter plates, while braided candleholders provide soft illumination for those gathered. The chairs, upholstered in deep crimson and black velvet, bear the serpentine motif of House Deyric, their frames reinforced with iron studs to withstand even the rowdiest of revelries.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["45627"],
  "loc_x": "1006",
  "loc_y": "1011",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "12",
  "gamerealmid": "1",
  "locationname": "South Hallway",
  "description": "The South Hallway is an open-air corridor stretching east to west, a passage where the grandeur of the keep meets the untamed beauty of the courtyard below. The north wall, built of dark stone, is adorned with intricate bas-reliefs, depicting ancient battles and legendary figures of Lord Deyric\u0027s lineage. Deeply carved into the stone near the Great Hall entrance, an imposing relief of the house sigil—a black iron tower, coiled by a serpent, with a silver crescent moon above—stands as a silent guardian over those who pass beneath it.\n\nThe south side of the hallway is lined with tall stone columns, their fluted shafts supporting elegantly carved capitals depicting entwined serpents, heraldic towers, and the waxing crescent moon. Between these columns, wide, worn steps descend into the Courtyard, offering an easy transition between the castle\u0027s fortified heart and the natural splendor beyond. Large bronze braziers, shaped like coiled serpents, stand between the columns, ready to be lit in the evening, casting flickering light across the flagstones.\n\nAt the western end, a heavy wooden door reinforced with black iron leads to the West Hallway, its surface inlaid with a silvered depiction of the castle—a subtle but unmistakable mark of Lord Deyric\u0027s dominion. To the east, another door, framed by an ornately carved stone arch, leads to the Southeast Hallway. At the center of the north wall, tall double doors of oak and iron open into the Great Hall, their massive hinges carved with serpents twisting around towering ramparts.\n\nAlong the north wall, a row of alcoves houses marble busts of past rulers and heroes of the keep, their expressions stern and regal, their names etched in old runes beneath them. Between these alcoves, tall iron sconces hold polished brass lanterns, their intricate latticework casting patterned shadows across the stone when lit.\n\nA long wooden bench, carved with interlocking serpents, runs beneath the alcoves, offering a place to rest and reflect on the figures immortalized in stone. Nearby, a pair of tall ceramic vases, fired in deep crimson and black, stand on iron pedestals, filled with seasonal flowers or fragrant herbs gathered from the courtyard gardens.\n\nThe floor is paved with smooth flagstones, their surfaces polished by centuries of passing feet. A few fallen leaves or petals often gather near the alcoves, carried in by the breeze through the open columns. As the sun sets, the golden light spills through the archways, painting the reliefs, statues, and banners in warm hues, transforming the hallway into a place of quiet beauty and solemn history.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["37", "24", "14", "13", "3"],
  "loc_x": "1006",
  "loc_y": "1006",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "19",
  "gamerealmid": "1",
  "locationname": "East Bathchamber",
  "description": "The East Bathchamber is a compact yet well-appointed space, designed for both bathing and personal needs, offering a private retreat within the castle. Its stone walls, smoothed by generations of upkeep, hold in warmth from the braziers positioned in each corner, while the polished slate floor gleams under flickering candlelight.\n\nAt the east end, a sturdy wooden door, reinforced with iron bands, leads to the Southeast Hallway. For additional privacy, a heavy crimson curtain, embroidered with serpentine patterns, can be drawn across the entrance.\n\nThe bathing basin, a large, sunken stone tub, dominates the chamber, carved from a single block of dark granite. Bronze bowls filled with herbs and scented oils rest on the basin\u0027s edge, while a copper ewer and a brass kettle, set upon a small brazier, provide warm water. A wooden bucket, reinforced with iron hoops, stands nearby for rinsing.\n\nTo the side, a wooden bench, cushioned with stuffed wool padding, offers a place to disrobe or rest, while a carved oak cabinet against the north wall stores linen towels, clay jars of soap paste, and vials of perfumed balms. Above it, a bronze mirror, set within an intricately engraved wooden frame, reflects the soft glow of iron wall sconces, their beeswax candles flickering gently.\n\nIn the southeast corner, a private garderobe is set within a small alcove, partially concealed by a curtain of woven reeds. The stone seat, built over a chute that leads to a cesspit below, is fitted with a smoothly carved opening. Nearby, a wooden shelf holds soft wool cloths, a small clay pot of cleansing sand, and a bundle of dried moss and leaves—natural alternatives to more refined comforts. A brass censer, hanging from an iron hook, is often filled with fragrant herbs to mask unpleasant odors.\n\nThough simple in function, the West Bathchamber blends practicality with quiet refinement, ensuring that even in a fortress of stone and steel, comfort and dignity are preserved.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["15"],
  "loc_x": "1007",
  "loc_y": "1002",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "16",
  "gamerealmid": "1",
  "locationname": "West Bathchamber",
  "description": "The West Bathchamber is a compact yet well-appointed space, designed for both bathing and personal needs, offering a private retreat within the castle. Its stone walls, smoothed by generations of upkeep, hold in warmth from the braziers positioned in each corner, while the polished slate floor gleams under flickering candlelight.\n\nAt the west end, a sturdy wooden door, reinforced with iron bands, leads to the Southwest Hallway. For additional privacy, a heavy crimson curtain, embroidered with serpentine patterns, can be drawn across the entrance.\n\nThe bathing basin, a large, sunken stone tub, dominates the chamber, carved from a single block of dark granite. Bronze bowls filled with herbs and scented oils rest on the basin\u0027s edge, while a copper ewer and a brass kettle, set upon a small brazier, provide warm water. A wooden bucket, reinforced with iron hoops, stands nearby for rinsing.\n\nTo the side, a wooden bench, cushioned with stuffed wool padding, offers a place to disrobe or rest, while a carved oak cabinet against the north wall stores linen towels, clay jars of soap paste, and vials of perfumed balms. Above it, a bronze mirror, set within an intricately engraved wooden frame, reflects the soft glow of iron wall sconces, their beeswax candles flickering gently.\n\nIn the southwest corner, a private garderobe is set within a small alcove, partially concealed by a curtain of woven reeds. The stone seat, built over a chute that leads to a cesspit below, is fitted with a smoothly carved opening. Nearby, a wooden shelf holds soft wool cloths, a small clay pot of cleansing sand, and a bundle of dried moss and leaves—natural alternatives to more refined comforts. A brass censer, hanging from an iron hook, is often filled with fragrant herbs to mask unpleasant odors.\n\nThough simple in function, the West Bathchamber blends practicality with quiet refinement, ensuring that even in a fortress of stone and steel, comfort and dignity are preserved.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["11"],
  "loc_x": "1007",
  "loc_y": "1002",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "1",
  "gamerealmid": "1",
  "locationname": "Main Hallway",
  "description": "The Grand Entrance Hallway is an imposing corridor of hewn stone, stretching north to south, its vaulted ceiling supported by thick wooden beams blackened by time and smoke. The walls, built from massive blocks of weathered granite, are adorned with faded tapestries depicting the conquests and lineage of Lord Deyric\u0027s ancestors. The air is cool and carries the mingled scents of damp stone, tallow smoke, and the faint traces of lingering incense from the great hall beyond.\n\nAt the northern end, the main entrance looms—a set of heavy oak doors reinforced with iron bands, their surface scarred by the marks of time. An ancient iron chandelier, suspended by a thick chain, hangs just inside the threshold, its tallow candles flickering and casting uneven shadows on the flagstone floor. Beneath the chandelier, a long wooden bench with carved legs sits against the wall, a place for weary travelers to rest while awaiting an audience.\n\nTo the east, a sturdy wooden door, fitted with an ornate iron handle shaped like a wolf\u0027s head, leads into the East Hallway. A narrow wooden table stands beside it, bearing an iron candle holder, a small clay bowl of salt for warding off evil, and a neatly stacked pile of parchment scrolls—likely messages from distant outposts. A few spears, their shafts worn smooth from years of use, lean against the wall nearby, within easy reach of the guards stationed here.\n\nTo the south, a grand double doorway, flanked by two carved stone pillars etched with faded runes, leads into the Great Hall. The faint murmur of voices and the occasional clatter of dishes drift through, along with the rich aroma of roasted meats and spiced wine. Just beside the entrance, a wooden sideboard holds a heavy bronze ewer filled with water and a set of polished drinking cups, available for guests or passing retainers in need of refreshment.\n\nOn the west wall, near the main entrance, a tall, narrow door leads to the Library. Its iron hinges are expertly crafted, and the door itself is set with a small brass plaque bearing an inscription in an old tongue. Just outside the entrance, a small reading table holds an inkwell, quill, and a single open ledger with carefully scribed entries—perhaps records of visitors, or notes for Lord Deyric\u0027s scholars.\n\nBeyond the west wall, a corridor leads further west, dimly lit by the occasional wall-mounted torch held in a rusted iron sconce. At the far end, a reinforced wooden door, darkened with age, marks the entrance to the West Hallway. Nearby, a simple wooden rack holds a set of cloaks and traveling garments, some dusted with road grime, likely belonging to those who have only recently arrived at the keep.\n\nThe hallway, though grand in scale, carries an air of restrained practicality—every piece of furniture, every item within it serves a purpose. This is not a place of idle luxury, but one where power, tradition, and readiness are woven into the very stone.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["2", "13", "22", "38", "24", "25"],
  "loc_x": "1008",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "34",
  "gamerealmid": "1",
  "locationname": "Main entrance",
  "description": "The Main Entrance is a modest yet solidly built entryway set deep into the northern wall of the castle keep. Though compact in size, the space exudes a quiet authority. Rough-hewn stone walls, cool to the touch and weather-darkened near the outer threshold, create a narrow but tall chamber that acts as a threshold between the North Castle Grounds and the inner halls of the keep.\n\nTo the north, a heavy oak door, bound in thick iron straps and reinforced with a locking bar from the inside, opens outward to the North Castle Grounds. Just above it, carved into a broad stone lintel, is a shallow relief of Lord Deyric\u0027s sigil: a black iron tower, a silver crescent moon, and a coiled iron serpent, all bordered with rivet-like notches—plain yet resolute, like the keep itself.\n\nTo the south, a second arched doorway, less fortified but no less sturdy, leads into the Main Hallway. This interior door is constructed of darker oak, worn smooth from generations of use.\n\nThe room is sparsely furnished but not without refinement. A stone bench sits flush against the eastern wall, offering a place for guards or messengers to rest momentarily. Above it, an iron wall sconce holds a torch, its bracket shaped like a coiled serpent with its mouth agape. A small iron brazier in the corner gives warmth on cold mornings, and a ceramic jug and basin rest atop a narrow wooden stand—provided for guests or riders arriving after a long journey.\n\nA rack of spears and a sturdy iron shield bearing Lord Deyric\u0027s sigil hang along the western wall—part decoration, part practical readiness. Beneath them, a wooden chest reinforced with iron contains spare cloaks, oilcloth wraps, and spare lanterns for use by the gatewardens.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["1"],
  "loc_x": "1008",
  "loc_y": "1016",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "22",
  "gamerealmid": "1",
  "locationname": "Pantry",
  "description": "The Pantry is a narrow, rectangular chamber running north to south, enclosed by thick stone walls that keep the space naturally cool and dry throughout the year. The eastern wall holds a sturdy wooden door leading to the Kitchen, its surface etched with knife marks and darkened by time and touch. A heavy iron latch keeps it sealed tightly against heat and pests.\n\nA small, deep-set window in the north wall allows a shaft of natural light to filter into the room. Iron bars reinforce the opening, and it\u0027s commonly kept cracked open for fresh air. Beneath it sits a broad stone shelf, home to glazed ceramic jars of dried lentils, barley, and beans. The scent of aged grain and smoked salt fills the air.\n\nShelving units made of aged oak run the length of the west and south walls, meticulously stocked with glass-stoppered bottles, cloth-wrapped wheels of hard cheese, bundles of dried herbs, and earthen crocks containing salted fish and pickled vegetables. A row of netted onions and garlic bulbs hangs overhead, swaying gently whenever the door opens.\n\nAt the center of the room stands a narrow preparation table, its top lined with brass scales, wax-paper rolls, and a thick wooden ledger listing quantities and deliveries in a practiced, neat script. A small, iron-bound lockbox beneath the table holds spices considered rare and precious—saffron, cinnamon bark, and clove, kept under key by the steward.\n\nA wicker basket stack occupies the southern corner, neatly arranged for collecting fresh produce from the courtyard gardens. Nearby, a small clay idol of a harvest goddess—its surface worn smooth from countless touches—sits in a carved alcove, a simple token of protection over the food stores.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["23"],
  "loc_x": "1010",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "15",
  "gamerealmid": "1",
  "locationname": "South East Hallway",
  "description": "The Southeast Hallway is a reversed L-shaped corridor, gracefully winding north to south before bending westward. Though primarily a passageway, it bears the marks of careful craftsmanship and quiet elegance, a space where function meets subtle beauty.\n\nAt the northern end, a heavy wooden door with iron reinforcements leads to the Banquet Hall, its surface engraved with faint vine and floral carvings, a subtle nod to the festivities within. Beside it, another sturdy door on the west side connects to the South Hallway, its iron latch worn smooth by years of use.\n\nThe east wall is punctuated by two guest room entrances—the first, near the hallway\u0027s northern half, leads to the East Guest Room, while the second, at the southern end, grants access to the Southeast Guest Bedroom. Both doors are framed by intricately carved stone lintels, depicting serpents curling around towers, reinforcing the castle\u0027s sigil and themes of resilience and watchfulness.\n\nAlong the west wall, a series of tall windows overlook the Courtyard below, their stone archways adorned with delicate tracery. Ornate wrought iron lanterns are affixed between the windows, holding beeswax candles that bathe the hallway in a soft golden glow come evening. Beneath one of the windows, a long wooden bench with a deep crimson cushion offers a resting spot, the scent of fresh herbs and flowers from the gardens below occasionally drifting through the air.\n\nAs the hallway turns westward at the southern end, a narrow wooden table stands against the wall, topped with a delicate porcelain vase filled with fresh wildflowers. A small bronze sculpture of a falcon mid-flight perches beside it, symbolizing nobility and keen sight—a favored motif in the castle\u0027s artistry. Opposite, a large tapestry hangs, depicting a nighttime hunt beneath a crescent moon, where shadowy riders on horseback chase a lone stag through an ancient forest.\n\nAt this western bend, a solid oak door leads to a descending staircase, providing access to the Courtyard below. At the very end of the corridor, another wooden door, its handle fashioned in the shape of a serpent\u0027s head, opens into the East Bathchamber.\n\nThe flagstone floor, smooth from centuries of use, is occasionally interrupted by woven rugs in deep red and silver, their patterns evoking celestial motifs and coiling serpents. The air carries the faint scents of wood polish, candle wax, and the distant aroma of roasting meats from the Banquet Hall, making the Southeast Hallway a passage both practical and quietly welcoming, where history lingers in every carved surface and shadowed corner.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["20", "7", "19", "14"],
  "loc_x": "1010",
  "loc_y": "1005",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "25",
  "gamerealmid": "1",
  "locationname": "East Hallway",
  "description": "The East Hallway winds through the eastern wing of the keep in an L-shaped path, its longer leg running east to west, before turning northward at its western end. Though a corridor by function, it is far from plain—this hall serves as both a thoroughfare and a subtle gallery, echoing with the quiet footfalls of servants and the faint aroma of roast and spice wafting from the nearby kitchens.\n\nAt the eastern end, a thick oaken door reinforced with iron bands opens to the Side Entrance, where guests and supplies alike pass into the keep. Just inside, a wall-mounted rack of decorative spears and hunting bows greets visitors, a reminder of both tradition and readiness. Beneath it, a granite-topped bench holds carved wooden trays for parcels and messages, and a tall clay jug filled with fresh-cut sprigs of wild rosemary offers a modest touch of fragrance.\n\nOn the south wall, a broad archway framed with carved stone garlands leads into the Banquet Hall, its heavy curtain tied back with a braided cord. Opposite, on the north wall, the kitchen door stands slightly ajar more often than not, a humble slab of aged wood softened by generations of use. Above it hangs a wooden plaque etched with a scene of a harvest feast, and beside it sits a small three-legged stool, often used by weary kitchen hands.\n\nAs the corridor continues west, the stone walls are broken up by niches housing decorative items—a bronze helmet once worn in Lord Deyric\u0027s youth, a small marble bust of Lady Seraph, and a row of glazed pottery vases imported from distant lands, their pale blue sheen catching the torchlight. Hanging between these alcoves are paintings on wooden panels, including a depiction of the castle as seen from the eastern cliffs, and another of a hunting party returning with stag and boar.\n\nAt the western turn, the hall rises slightly on two shallow stone steps, leading to a door on the west wall—a tall, iron-hinged portal that opens into the Main Hallway. A woven woolen runner, dyed in hues of deep crimson and black, stretches along the hall\u0027s center, its edges weighted with intricate iron studs resembling rivets—mirroring the border of House Deyric\u0027s sigil.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["35", "23", "24"],
  "loc_x": "1010",
  "loc_y": "1012",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "24",
  "gamerealmid": "1",
  "locationname": "Banquet Hall",
  "description": "The Banquet Hall is a grand, square chamber where celebration and ceremony converge beneath the vaulted wooden beams of its high ceiling. The walls are built of finely chiseled stone, cool to the touch and adorned with both opulence and martial pride.\n\nOn the east wall, a series of tall arched windows flood the room with golden morning light, casting long rays across the polished flagstone floor. Through the glass, one can glimpse the eastern gardens of the castle grounds—a tranquil contrast to the Hall\u0027s vibrant interior.\n\nThe north wall holds a broad doorway that opens into the East Hallway, framed with intricately carved stone pillars adorned with laurel and vine motifs. Near this entrance stands a suit of ceremonial armor, burnished to a high shine and standing at silent attention, clutching a spear beneath a crimson and silver banner bearing Lord Deyric\u0027s sigil—a black iron tower beneath a silver crescent, coiled by a serpent.\n\nOn the west wall, a grand double door connects to the Great Hall, its frame carved with images of feasting and victory. Flanking the doors are two iron-rimmed round shields mounted on the wall, crossed by a pair of ornate axes—each weapon said to have belonged to Deyric\u0027s forebears.\n\nThe southern wall contains a smaller but finely made door on the western side, leading discreetly to the South East Hallway. Nearby hangs a vivid tapestry, woven with deep reds and golds, depicting a banquet hosted after the Siege of Three Rivers—a pivotal moment in House Deyric\u0027s rise to power.\n\nThe heart of the room is dominated by a long feasting table of dark oak, large enough to seat two dozen guests comfortably. Its surface gleams with polish and is set with pewter dishes, wooden goblets, and a silver candelabra carved in the likeness of twining serpents. Smaller side tables ring the hall, each topped with bronze bowls of fruit, platter stands, or pitchers of wine and honeyed mead.\n\nHigh upon the walls, mounted helms, aged swords, and battle-worn banners remind guests of the martial legacy of the keep. Between them, painted wooden panels depict scenes of seasonal feasts, hunts in the highlands, and a stylized rendering of Lady Seraph in her youth—calm-eyed and regal.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["25", "15", "13"],
  "loc_x": "1010",
  "loc_y": "1010",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "23",
  "gamerealmid": "1",
  "locationname": "Kitchen",
  "description": "The Kitchen is a long, rectangular chamber running north to south, alive with the scents of woodsmoke, herbs, and roasted meat. It is the warm, beating heart of the castle\u0027s daily rhythm—a place of order, utility, and quiet mastery.\n\nA large, latticed window on the north wall lets in pale daylight and fresh mountain air. Beneath it, a broad stone sink drains through a carved channel that runs out to the hillside beyond. Beside the sink stands a table of stained oak, its surface worn smooth from years of use. Clay jugs of water, copper pots, and drying bundles of herbs hang from pegs above.\n\nThe eastern wall holds the main entrance to the kitchen, a wide arch framed in soot-darkened stone. Through this arch, servants and aides pass in and out with trays and platters. A tall iron rack stands beside the doorway, bristling with ladles, knives, tongs, and skewers suspended on iron hooks.\n\nThe southern wall features a sturdy wooden door leading to the East Hallway, kept closed to prevent drafts from disrupting the cook fires. Beside it, a narrow shelf holds jars of pickled vegetables, earthenware crocks of salt, and a small brass bell used to summon attendants during busy mealtimes.\n\nOn the western wall, a low arched doorway leads to the Pantry, its threshold lined with flat stones worn smooth by countless footsteps. Near it, a massive stone hearth takes pride of place—its fire always tended. Above the hearth hangs a spit for roasting, with a blackened cauldron suspended from a chain. Hooks along the mantle hold bundled garlic, onions, and dried sausages, and a small carved figurine of a kitchen spirit—a plump-cheeked idol of clay—is tucked into the corner for luck and protection.\n\nA pair of long worktables dominate the center of the room, their surfaces marked by decades of chopping, kneading, and slicing. Wooden bowls, graters made of punched tin, and stone mortars are neatly arranged alongside platters of root vegetables, fresh bread, and smoked fish.\n\nHanging from the rafters are dried herbs, lavender bundles, and cured meats, suspended by twine. Shelves built into the stone walls hold stacks of clay plates, wooden trenchers, and hand-woven baskets for carrying food through the keep.\n\nDespite its utilitarian purpose, the Kitchen is a space of warmth and constancy, where meals are crafted with care and precision. The scent of rosemary and oak smoke lingers in the air, and the steady rhythm of chopping, stirring, and baking brings life to the castle\u0027s stone walls",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["25", "22", "36"],
  "loc_x": "1011",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "7",
  "gamerealmid": "1",
  "locationname": "West Guest Room",
  "description": "The West Guest Bedroom is a warm and inviting chamber, designed to provide comfort and refinement to esteemed visitors of the castle. Its rectangular layout is filled with carefully chosen furnishings that blend functionality with quiet luxury, ensuring that guests feel both welcomed and honored during their stay.\nThe east wall features a sturdy wooden door, its iron handle and hinges embossed with subtle serpent and crescent motifs, marking the room\u0027s connection to the West Hallway. A woven wall hanging, depicting a stylized black iron tower entwined by a silver serpent, is draped above the doorway, serving as a quiet reminder of Lord Deyric\u0027s household.\nOn the west wall, a tall, narrow window allows golden light to spill into the chamber, casting long shadows over the stone floor. The window offers a breathtaking view of the distant mountain ridges and rolling woodlands beyond the castle walls. Below it, a beautifully crafted dressing table of dark oak stands, its surface inlaid with delicate silver filigree. A silver-edged mirror, finely polished, sits atop the table, reflecting the soft glow of beeswax candles resting in intricately sculpted brass holders. A plush velvet-covered stool, embroidered with a subtle moon-and-serpent pattern, is tucked neatly beneath. On the table, a small porcelain dish holds a selection of fragrant herbs and dried lavender, ensuring a pleasant aroma lingers in the air.\nThe south wall hosts an unusual painting, drawing the eye with its mystical imagery. It portrays a shadowy forest, its ancient trees twisting into unnatural shapes, their roots curling around glowing mushrooms. A full moon hangs low in the sky, casting an eerie silver light upon a solitary figure, shrouded in mist, standing at the heart of the woodland. The painting seems to shift subtly depending on the angle of the light, inviting contemplation and quiet wonder. Below the painting, a tall wooden pedestal holds a delicate glass orb, containing fine black sand.\nThe centerpiece of the room is a sturdy, four-poster bed, crafted from polished mahogany. The headboard and posts are carved with ivy and celestial motifs, while deep crimson drapes hang from the canopy, offering warmth and privacy. The bed is dressed in richly woven blankets and plush linens, their deep hues of red and gold echoing the banners of the keep. At the foot of the bed, a large wooden chest with iron-reinforced edges sits, providing ample storage for guests\u0027 belongings. The lockplate, fashioned in the shape of a serpent\u0027s coiled body, gleams subtly in the candlelight.\nTo the right of the bed, a small side table supports a delicate silver candelabra, its tall wax candles flickering softly. Beside it, a bronze statuette of a watchful owl, its eyes inset with tiny onyx stones, perches atop a stack of well-worn books, offering a quiet symbol of wisdom and vigilance.\nDespite its elegance, the West Guest Bedroom remains a space of subtle, understated comfort. The scent of aged wood, soft beeswax, and faint lavender lingers in the air, and the cool evening breeze that drifts through the window carries with it the distant sound of the courtyard fountains. Here, a weary traveler can find respite, enveloped in a world of refinement, mystery, and quiet luxury.\n\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["3", "28"],
  "loc_x": "1011",
  "loc_y": "1006",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "21",
  "gamerealmid": "1",
  "locationname": "East Guest Room",
  "description": "The East Guest Room is a square, well-appointed chamber offering both comfort and privacy for noble visitors or learned guests. A sturdy oaken door on the west wall, reinforced with dark iron and carved with a simple braided border, opens directly to the South-East Hallway, ensuring ease of access while preserving a sense of seclusion.\n\nThe east-facing window—tall and narrow—brings in the pale morning light and grants a tranquil view of the East Castle Gardens. From this vantage, guests can admire the winding garden paths, small stone fountains, and carefully tended herb beds that fill the outer grounds with life and color. The window is framed with woolen drapes, dyed a gentle forest green, and pinned back with bronze leaf-shaped clasps.\n\nAt the center of the room sits a sturdy, high-post bed, carved from ash wood and wrapped in layered woolen blankets, linen sheets, and a thick coverlet dyed deep indigo, embroidered subtly at the corners with the crescent and serpent motif of House Deyric. A wrought-iron lantern hangs from a wall bracket nearby, its warm glow illuminating the bed on colder nights.\n\nBeside the bed stands a small side table, topped with a polished horn bowl, a ceramic oil lamp, and a curious bone-handled letter opener shaped like a bird in flight. A wooden chest rests at the foot of the bed, fitted with a simple locking clasp, offering ample space for the guest\u0027s belongings.\n\nThe north wall holds a stone shelf, upon which rest a trio of glazed clay jars, each bearing faint inscriptions in the Old Tongue—likely remnants of alchemical or herbal uses. A small, delicate bronze sculpture of a wild stag stands between them, poised mid-stride with impressive realism.\n\nA narrow writing desk sits below the window, flanked by a straight-backed chair with a padded wool seat. On the desk lie several scraps of parchment, a tarnished inkpot, and a quill trimmed from a mountain hawk\u0027s feather, suggesting quiet space for thought or correspondence.\n\nOn the south wall, a tapestry depicting the Eastern Highlands hangs in muted tones of ochre and green, its threads worn but still vibrant. It shows distant peaks bathed in sunlight, with a single tower visible in the far distance—perhaps a romanticized vision of the keep itself.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["15"],
  "loc_x": "1011",
  "loc_y": "1006",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "20",
  "gamerealmid": "1",
  "locationname": "South East Guest Room",
  "description": "The South-East Guest Room is a quiet, square-shaped chamber designed to offer visiting nobles or honored guests both comfort and seclusion. It lies just off the South-East Hallway, accessible through a carved oak door set into the west wall, banded in blackened iron and fitted with a bronze handle shaped like a curling serpent.\nA wide window on the south wall, framed in heavy timber, bathes the room in golden daylight. It provides an imposing view of the surrounding mountains. A pair of woolen drapes, dyed deep green and pinned with bronze clasps, can be drawn to block out wind or glare.\nAt the heart of the chamber stands a modest yet finely made bed, its frame of dark wood carved with vines and knotwork. The bed is dressed in undyed linen sheets, a stuffed woolen mattress, and a coverlet of deep crimson, embroidered at the edges with silver thread in the form of Lord Deyric\u0027s tower-and-serpent sigil. A low, carved chest sits at the foot of the bed, offering space for guests\u0027 belongings.\nTo the right of the bed, beneath the window, rests a small writing table, its surface scattered with blank parchment, a feather quill, and a bronze ink pot shaped like a crouching lion. A wooden chair, its backrest carved with curling foliage, completes the writing nook.\nSet along the north wall, a stone shelf inset into the wall holds a collection of small curiosities: a trio of painted clay figurines, a tiny silver hourglass, and a weathered, ivory-bound book of mountain folktales. Above the shelf hangs a painting of a windswept cliffside, with wild goats clinging to impossible heights and stormclouds breaking over distant peaks—both beautiful and humbling.\nOn the east wall, a bronze wall sconce holds a pair of beeswax candles, while a woven rug lies at the center of the stone floor, its geometric patterns dyed in dark red and slate blue. Tucked discreetly near the door is a ceramic water basin and ewer, placed atop a three-legged stand, with a folded cloth for washing.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["15"],
  "loc_x": "1011",
  "loc_y": "1003",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "26",
  "gamerealmid": "1",
  "locationname": "South East Secret Passage",
  "description": "The South East Secret Passage, a clandestine, narrow corridor, carved skillfully into the stone of the mountain, snakes its way from the west, meandering eastward before a sudden shift northward at its eastern extremity. Along the south-north section, a series of small, round openings, or spy holes, are carved into the west wall, offering a furtive glimpse into the south-east Guest Bedroom and further along, the east Guest Bedroom. The walls are lined with dark, dense wood, worn smooth by centuries of use.\nAt the passage\u0027s western terminus, a sturdy oak door stands, its intricate iron handle adorned with stylized serpents, hinting at its concealed purpose. This door leads to the South Secret Passage. As the passage reaches its northern end, a more imposing door looms, its iron-bound oak frame a stark contrast against the dimly lit corridor. This door grants access to the Dungeon stairway, a descent into the castle\u0027s darker, more sinister depths.\nThe passage itself is illuminated by flickering torches, their light casting elongated shadows along the stone walls, creating an atmosphere of secrecy and intrigue.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["27", "40"],
  "loc_x": "1013",
  "loc_y": "1007",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "36",
  "gamerealmid": "1",
  "locationname": "Kitchen Entrance",
  "description": "The Kitchen Entrance serves as a functional yet carefully maintained access point connecting the East Castle Grounds with the inner workings of the keep. This modest antechamber is rectangular in shape, its stone-flagged floor worn smooth by generations of servants, cooks, and messengers passing between garden and hearth.\n\nOn the west wall, a sturdy oak door, darkened by smoke and handling, leads directly into the Kitchen. Its iron fittings are practical and well-maintained, and a small wooden shelf beside the doorway holds a weathered ledger and charcoal pencil, used to track deliveries or note missing supplies. A wooden bench stands nearby—ideal for setting down baskets of herbs or baskets of produce awaiting inspection.\n\nThe east-facing doorway opens to the East Castle Grounds, framed in a shallow arch of weathered limestone. A heavy canvas curtain, bound to one side during the day, can be drawn to keep out wind and insects. Just outside, a stone step leads down to the garden paths, and a pair of iron boot scrapers flank the threshold.\n\nAbove the entrance hangs a wooden carving of a boar\u0027s head—symbolizing hearth and sustenance—darkened with smoke from the kitchen beyond. Iron hooks line a small section of the southern wall, where cloaks or aprons may be hung, and a narrow, glazed window set high in the wall offers a view of the eastern gardens, allowing the scent of rosemary and thyme to mingle faintly with the aromas of the kitchen within.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["23"],
  "loc_x": "1013",
  "loc_y": "1014",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "35",
  "gamerealmid": "1",
  "locationname": "Side Entrance",
  "description": "The Side Entrance is a narrow but well-constructed entryway, nestled into the eastern wall of the keep and serving as a quieter, more discreet point of access than the grand Main Entrance to the north. Though modest in appearance, it is built with the same precision and strength as the rest of the stronghold—designed for function, privacy, and controlled movement between the keep and the East Castle Grounds.\n\nTo the east, a solid wooden door, darkened by years of weather and fitted with black iron bands, opens outward to the East Castle Grounds. Its arched frame is cut cleanly into the stone wall, with a small overhang of slate tiles above to shield it from the elements. A wrought-iron pull ring, slightly polished from use, serves as the handle, while a simple iron latch secures it from within.\n\nTo the west, an interior doorway leads into the East Hallway, framed in smooth-cut stone and fitted with a reinforced oak door, built to swing silently on well-oiled hinges. This passage is often used by servants, attendants, and trusted guests moving between the keep\u0027s interior and the gardens, avoiding the busier corridors and main entrances.\n\nThe chamber itself is small and spare, just wide enough to accommodate a few people passing through at once. Along the south wall, a narrow bench of carved ash wood offers a place to sit or remove muddied boots, with a pair of iron hooks mounted above for cloaks and riding gear. A ceramic water jug and basin rest on a three-legged stool nearby, set out for washing up before entering the keep.\n\nMounted on the north wall is a decorative spear and shield, the latter bearing a faded but still distinct version of Lord Deyric\u0027s sigil—a black iron tower beneath a silver crescent, encircled by a coiled serpent. Beside it hangs a leather satchel, worn but serviceable, used for carrying small parcels or messages.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["25"],
  "loc_x": "1013",
  "loc_y": "1011",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "40",
  "gamerealmid": "1",
  "locationname": "Dungeon stairway",
  "description": "The Dungeon Stairway is a narrow, dimly lit descent hewn directly from the bedrock beneath the castle. The walls are rough and uneven, bearing the marks of hand tools and years of wear. The air grows noticeably colder as one descends, heavy with the scent of damp stone and old iron.\n\nAt the top of the stairway, to the west, stands a thick wooden door bound in blackened iron, its surface scarred and weathered. This door connects to the South East Secret Passage, cleverly concealed to blend with the surrounding masonry and barred from the inside with a stout iron latch.\n\nThe stone steps are steep and uneven, worn smooth in the center from generations of use. A single iron sconce near the top holds a tallow torch, casting flickering shadows down the passage. A narrow gutter runs along the inner edge of the stairwell, channeling any seeping moisture away from the steps.\n\nAt the base of the stairs, the passage terminates in a heavy iron-bound door set into the north wall, its frame reinforced with stone blocks and lined with riveted plates. The iron latch is thick, requiring considerable strength to lift. A small, grated peephole—no larger than a clenched fist—offers a narrow view into the darkness beyond.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["26", "37"],
  "loc_x": "1014",
  "loc_y": "1007",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-04-19 09:32:47.268992 UTC",
  "updatedAt": "2025-04-19 09:32:47.268992 UTC",
  "Setting": null
}, {
  "locationid": "2",
  "gamerealmid": "4",
  "locationname": "Library",
  "description": "The Library is a rectangular chamber of quiet reverence, its north-south length stretching half again as long as its west-east width. Dark wooden shelves line the walls, their surfaces smooth with age and laden with tomes bound in leather and cloth. The air carries the scent of parchment, ink, and aged wood, mingling with the faint aroma of beeswax from candles flickering in iron sconces.\n\nA tall window on the north wall lets in pale daylight, its lattice of iron bars forming a geometric pattern against the glass. Below it, on the eastern side, a large bookcase stands filled with meticulously arranged volumes, its highest shelves accessible by a wooden ladder. Some books bear the sigil of Lord Deyric—a black iron tower upon a crimson field, entwined with a coiled serpent and crowned by a silver crescent moon, embossed in silver on their spines.\n\nAt the center of the room, a sturdy reading table of dark oak is scattered with open tomes, parchment scrolls, and a bronze inkwell with a quill resting beside it. A small oil lamp, its glass chimney smudged with soot, provides additional illumination. Surrounding the table are several high-backed chairs, their wooden frames carved with Lord Deyric\u0027s sigil, marking this as a place of study for his scholars and advisors.\n\nTo the west, a doorway leads into the Lord\u0027s Hallway, its frame subtly adorned with carved ivy. To the east, another door opens into the Main Hallway, its threshold softened by a well-worn rug. Against the west wall, a writing desk holds neatly stacked scrolls, a half-melted candle in a brass holder, and a signet stamp bearing Deyric\u0027s sigil, used for marking official records.\n\nThe library is a sanctuary of thought and history, where the weight of knowledge presses down from every shelf, and the presence of Lord Deyric\u0027s legacy lingers in the very stones.",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["1", "6", "30"],
  "loc_x": "1006",
  "loc_y": "1015",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-05-08 14:18:07.942941 UTC",
  "updatedAt": "2025-05-08 14:18:07.942941 UTC",
  "Setting": null
}, {
  "locationid": "20",
  "gamerealmid": "3",
  "locationname": "South East Guest Room",
  "description": "The South-East Guest Room is a quiet, square-shaped chamber designed to offer visiting nobles or honored guests both comfort and seclusion. It lies just off the South-East Hallway, accessible through a carved oak door set into the west wall, banded in blackened iron and fitted with a bronze handle shaped like a curling serpent.\nA wide window on the south wall, framed in heavy timber, bathes the room in golden daylight. It provides an imposing view of the surrounding mountains. A pair of woolen drapes, dyed deep green and pinned with bronze clasps, can be drawn to block out wind or glare.\nAt the heart of the chamber stands a modest yet finely made bed, its frame of dark wood carved with vines and knotwork. The bed is dressed in undyed linen sheets, a stuffed woolen mattress, and a coverlet of deep crimson, embroidered at the edges with silver thread in the form of Lord Deyric\u0027s tower-and-serpent sigil. A low, carved chest sits at the foot of the bed, offering space for guests\u0027 belongings.\nTo the right of the bed, beneath the window, rests a small writing table, its surface scattered with blank parchment, a feather quill, and a bronze ink pot shaped like a crouching lion. A wooden chair, its backrest carved with curling foliage, completes the writing nook.\nSet along the north wall, a stone shelf inset into the wall holds a collection of small curiosities: a trio of painted clay figurines, a tiny silver hourglass, and a weathered, ivory-bound book of mountain folktales. Above the shelf hangs a painting of a windswept cliffside, with wild goats clinging to impossible heights and stormclouds breaking over distant peaks—both beautiful and humbling.\nOn the east wall, a bronze wall sconce holds a pair of beeswax candles, while a woven rug lies at the center of the stone floor, its geometric patterns dyed in dark red and slate blue. Tucked discreetly near the door is a ceramic water basin and ewer, placed atop a three-legged stand, with a folded cloth for washing.\n",
  "region": null,
  "country": null,
  "continent": null,
  "exits": ["15"],
  "loc_x": "1011",
  "loc_y": "1003",
  "loc_z": "1",
  "size_x": null,
  "size_y": null,
  "size_z": null,
  "terrain": null,
  "microclimate": null,
  "shapefile": null,
  "createdAt": "2025-05-08 14:16:59.596049 UTC",
  "updatedAt": "2025-05-08 14:16:59.596049 UTC",
  "Setting": "Fizrae knocks and enters the guest room in the middle of the night, finding Sir Gelarthon reading by candle light, he seems surprised and perhaps excited to see her, Fizrae has a mischevious grin on her face as enters."
}]